import React from 'react';

const PrivatePolicyContent = () => {
    return (
        <div className="container-lg mt-5 mb-5">
            <h1>Пользовательское Соглашение</h1>
            <p>Настоящее Пользовательское Соглашение (Далее Соглашение) регулирует отношения между владельцем IP адрес сервера (далее АИС Учета Сотрудников или Администрация) с одной стороны и пользователем сайта с другой.
                Сайт АИС Учета Сотрудников не является средством массовой информации.</p>

            <p>Используя сайт, Вы соглашаетесь с условиями данного соглашения.</p>
            <strong>Если Вы не согласны с условиями данного соглашения, не используйте сайт АИС Учета Сотрудников!
            </strong>

            <h1 className="mt-4">Права и обязанности сторон</h1>
            <p>Пользователь имеет право:</p>
            <p>- осуществлять поиск информации на сайте</p>
            <p>- получать информацию на сайте</p>
            <p>- использовать информацию сайта в личных некоммерческих целях</p>
            <strong>Администрация имеет право:</strong>

            <p>- по своему усмотрению и необходимости создавать, изменять, отменять правила</p>
            <p>- ограничивать доступ к любой информации на сайте</p>
            <p>- создавать, изменять, удалять информацию</p>
            <p>- удалять учетные записи</p>
            <p>- отказывать в регистрации без объяснения причин</p>

            <strong>Пользователь обязуется:</strong>

            <p>- обеспечить достоверность предоставляемой информации</p>
            <p>- обеспечивать сохранность личных данных от доступа третьих лиц</p>
            <p>- обновлять Персональные данные, предоставленные при регистрации, в случае их изменения</p>
            <p>- не копировать информацию с других источников</p>
            <p>- при копировании информации с других источников, включать в её состав информацию об авторе</p>
            <p>- не распространять информацию, которая направлена на пропаганду войны, разжигание национальной, расовой или религиозной ненависти и вражды, а также иной информации, за распространение которой предусмотрена уголовная или административная ответственность</p>
            <p>- не нарушать работоспособность сайта</p>
            <p>- не создавать несколько учётных записей на Сайте, если фактически они принадлежат одному и тому же лицу</p>
            <p>- не совершать действия, направленные на введение других Пользователей в заблуждение</p>
            <p>- не передавать в пользование свою учетную запись и/или логин и пароль своей учетной записи третьим лицам</p>
            <p>- не регистрировать учетную запись от имени или вместо другого лица за исключением случаев, предусмотренных законодательством РФ</p>
            <p>- не размещать материалы рекламного, эротического, порнографического или оскорбительного характера, а также иную информацию, размещение которой запрещено или противоречит нормам действующего законодательства РФ</p>
            <p>- не использовать скрипты (программы) для автоматизированного сбора информации и/или взаимодействия с Сайтом и его Сервисами</p>

            <strong>Администрация обязуется:</strong>

            <p>- поддерживать работоспособность сайта за исключением случаев, когда это невозможно по независящим от Администрации причинам.</p>
            <p>- осуществлять разностороннюю защиту учетной записи Пользователя</p>
            <p>- защищать информацию, распространение которой ограничено или запрещено законами путем вынесения предупреждения либо удалением учетной записи пользователя, нарушившего правила</p>
            <p>- предоставить всю доступную информацию о Пользователе уполномоченным на то органам государственной власти в случаях, установленных законом</p>

            <h1 className="mt-4">Ответственность сторон</h1>

            <p>- пользователь лично несет полную ответственность за распространяемую им информацию</p>
            <p>- администрация не несет никакой ответственности за достоверность информации, скопированной из других источников</p>
            <p>- администрация не несёт ответственность за несовпадение ожидаемых Пользователем и реально полученных услуг</p>
            <p>- администрация не несет никакой ответственности за услуги, предоставляемые третьими лицами</p>
            <p>- в случае возникновения форс-мажорной ситуации (боевые действия, чрезвычайное положение, стихийное бедствие и т. д.) Администрация не гарантирует сохранность информации, размещённой Пользователем, а также бесперебойную работу информационного ресурса</p>

            <h1 className="mt-4">Условия действия Соглашения</h1>

            <p>Данное Соглашение вступает в силу при любом использовании данного сайта.</p>
            <p>Соглашение действует бессрочно.</p>
            <p>Администрация оставляет за собой право в одностороннем порядке изменять данное соглашение по своему усмотрению.</p>
            <p>Администрация не оповещает пользователей об изменении в Соглашении.</p>

            <p className="mb-5">Соглашение разработано на базе юридических документов сервиса Правилль</p>
        </div>
    );
};

export default PrivatePolicyContent;
